In [1]:
import pandas as pd
import numpy as np

In [2]:
dt = pd.read_csv('ds_salaries.csv')

In [3]:
dt.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [4]:
dt.shape

(3755, 11)

In [5]:
dt.describe()

         work_year        salary  salary_in_usd  remote_ratio
count  3755.000000  3.755000e+03    3755.000000   3755.000000
mean   2022.373635  1.906956e+05  137570.389880     46.271638
std       0.691448  6.716765e+05   63055.625278     48.589050
min    2020.000000  6.000000e+03    5132.000000      0.000000
25%    2022.000000  1.000000e+05   95000.000000      0.000000
50%    2022.000000  1.380000e+05  135000.000000      0.000000
75%    2023.000000  1.800000e+05  175000.000000    100.000000
max    2023.000000  3.040000e+07  450000.000000    100.000000

In [6]:
#Calculate unique job titles: 
unique_job_titles = np.unique(dt['job_title'])
total_unique_job_titles = len(unique_job_titles)
print("Total number of unique job titles:", total_unique_job_titles)
column_values = dt['job_title']
unique_values = np.unique(column_values)
print(unique_values)

Total number of unique job titles: 93
['3D Computer Vision Researcher' 'AI Developer' 'AI Programmer'
 'AI Scientist' 'Analytics Engineer' 'Applied Data Scientist'
 'Applied Machine Learning Engineer' 'Applied Machine Learning Scientist'
 'Applied Scientist' 'Autonomous Vehicle Technician' 'Azure Data Engineer'
 'BI Analyst' 'BI Data Analyst' 'BI Data Engineer' 'BI Developer'
 'Big Data Architect' 'Big Data Engineer' 'Business Data Analyst'
 'Business Intelligence Engineer' 'Cloud Data Architect'
 'Cloud Data Engineer' 'Cloud Database Engineer' 'Compliance Data Analyst'
 'Computer Vision Engineer' 'Computer Vision Software Engineer'
 'Data Analyst' 'Data Analytics Consultant' 'Data Analytics Engineer'
 'Data Analytics Lead' 'Data Analytics Manager'
 'Data Analytics Specialist' 'Data Architect' 'Data DevOps Engineer'
 'Data Engineer' 'Data Infrastructure Engineer' 'Data Lead'
 'Data Management Specialist' 'Data Manager' 'Data Modeler'
 'Data Operations Analyst' 'Data Operations Engineer'
 'Data Quality Analyst' 'Data Science Consultant' 'Data Science Engineer'
 'Data Science Lead' 'Data Science Manager' 'Data Science Tech Lead'
 'Data Scientist' 'Data Scientist Lead' 'Data Specialist'
 'Data Strategist' 'Deep Learning Engineer' 'Deep Learning Researcher'
 'Director of Data Science' 'ETL Developer' 'ETL Engineer'
 'Finance Data Analyst' 'Financial Data Analyst' 'Head of Data'
 'Head of Data Science' 'Head of Machine Learning' 'Insight Analyst'
 'Lead Data Analyst' 'Lead Data Engineer' 'Lead Data Scientist'
 'Lead Machine Learning Engineer' 'ML Engineer' 'MLOps Engineer'
 'Machine Learning Developer' 'Machine Learning Engineer'
 'Machine Learning Infrastructure Engineer' 'Machine Learning Manager'
 'Machine Learning Research Engineer' 'Machine Learning Researcher'
 'Machine Learning Scientist' 'Machine Learning Software Engineer'
 'Manager Data Management' 'Marketing Data Analyst'
 'Marketing Data Engineer' 'NLP Engineer' 'Power BI Developer'
 'Principal Data Analyst' 'Principal Data Architect'
 'Principal Data Engineer' 'Principal Data Scientist'
 'Principal Machine Learning Engineer' 'Product Data Analyst'
 'Product Data Scientist' 'Research Engineer' 'Research Scientist'
 'Software Data Engineer' 'Staff Data Analyst' 'Staff Data Scientist']

In [7]:
#Calculate # & list types of experience levels 
unique_experience_levels = np.unique(dt['experience_level'])
total_unique_experience_levels = len(unique_experience_levels)
print("Total number of experience levels:", total_unique_experience_levels)
column_values = dt['experience_level']
unique_values = np.unique(column_values)
print(unique_values)

Total number of experience levels: 4
['EN' 'EX' 'MI' 'SE']

In [8]:
#Calculate # of employee residences & list employee residences
unique_employee_residences = np.unique(dt['employee_residence'])
total_unique_employee_residences = len(unique_employee_residences)
print("Total number of employee residences:", total_unique_employee_residences)
column_values = dt['employee_residence']
unique_values = np.unique(column_values)
print(unique_values)

Total number of employee residences: 78
['AE' 'AM' 'AR' 'AS' 'AT' 'AU' 'BA' 'BE' 'BG' 'BO' 'BR' 'CA' 'CF' 'CH'
 'CL' 'CN' 'CO' 'CR' 'CY' 'CZ' 'DE' 'DK' 'DO' 'DZ' 'EE' 'EG' 'ES' 'FI'
 'FR' 'GB' 'GH' 'GR' 'HK' 'HN' 'HR' 'HU' 'ID' 'IE' 'IL' 'IN' 'IQ' 'IR'
 'IT' 'JE' 'JP' 'KE' 'KW' 'LT' 'LU' 'LV' 'MA' 'MD' 'MK' 'MT' 'MX' 'MY'
 'NG' 'NL' 'NZ' 'PH' 'PK' 'PL' 'PR' 'PT' 'RO' 'RS' 'RU' 'SE' 'SG' 'SI'
 'SK' 'TH' 'TN' 'TR' 'UA' 'US' 'UZ' 'VN']

In [9]:
#Calculate # of company locations & list company locations
unique_company_locations = np.unique(dt['company_location'])
total_unique_company_locations = len(unique_company_locations)
print("Total number of company locations:", total_unique_company_locations)
column_values = dt['company_location']
unique_values = np.unique(column_values)
print(unique_values)

Total number of company locations: 72
['AE' 'AL' 'AM' 'AR' 'AS' 'AT' 'AU' 'BA' 'BE' 'BO' 'BR' 'BS' 'CA' 'CF'
 'CH' 'CL' 'CN' 'CO' 'CR' 'CZ' 'DE' 'DK' 'DZ' 'EE' 'EG' 'ES' 'FI' 'FR'
 'GB' 'GH' 'GR' 'HK' 'HN' 'HR' 'HU' 'ID' 'IE' 'IL' 'IN' 'IQ' 'IR' 'IT'
 'JP' 'KE' 'LT' 'LU' 'LV' 'MA' 'MD' 'MK' 'MT' 'MX' 'MY' 'NG' 'NL' 'NZ'
 'PH' 'PK' 'PL' 'PR' 'PT' 'RO' 'RU' 'SE' 'SG' 'SI' 'SK' 'TH' 'TR' 'UA'
 'US' 'VN']

In [10]:
#Calculate average salary
average_salary = np.mean(dt["salary"])
print(f"Average salary: ${average_salary:.2f}")

Average salary: $190695.57

In [11]:
#Calculate average salary based on experience level
average_salary_e = dt.groupby('experience_level')['salary'].mean()
average_salary_ex = average_salary_e.reset_index()
print(average_salary_ex)

  experience_level         salary
0               EN  188381.178125
1               EX  246802.201754
2               MI  248200.306832
3               SE  170048.965421

In [12]:
#Calculate average salary based on employment type
average_salary_et = dt.groupby('employment_type')['salary'].mean()
average_salary_emp = average_salary_et.reset_index()
print(average_salary_emp)

  employment_type         salary
0              CT  113300.000000
1              FL  288755.500000
2              FT  191146.539268
3              PT   79910.823529

In [13]:
#Calculate average salary based on job title 
average_salary_j = dt.groupby('job_title')['salary'].mean()
average_salary_jt = average_salary_j.reset_index()
print(average_salary_jt)

                        job_title         salary
0   3D Computer Vision Researcher  120000.000000
1                    AI Developer  137181.818182
2                   AI Programmer   55000.000000
3                    AI Scientist  275312.500000
4              Analytics Engineer  151352.621359
..                            ...            ...
88              Research Engineer  162752.810811
89             Research Scientist  160768.890244
90         Software Data Engineer   75000.000000
91             Staff Data Analyst   15000.000000
92           Staff Data Scientist  105000.000000

[93 rows x 2 columns]

In [14]:
#Calculate average salary based on employee residence 
average_salary_er = dt.groupby('employee_residence')['salary'].mean()
average_salary_emres = average_salary_er.reset_index()
print(average_salary_emres)

   employee_residence         salary
0                  AE  100000.000000
1                  AM   50000.000000
2                  AR   35500.000000
3                  AS   32777.500000
4                  AT   65833.333333
..                ...            ...
73                 TR  114600.000000
74                 UA   57850.000000
75                 US  152822.011651
76                 UZ  103000.000000
77                 VN   33466.666667

[78 rows x 2 columns]

In [15]:
#Calculate average salary based on company location 
average_salary_c = dt.groupby('company_location')['salary'].mean()
average_salary_cl = average_salary_c.reset_index()
print(average_salary_cl)

   company_location         salary
0                AE  100000.000000
1                AL   10000.000000
2                AM   50000.000000
3                AR   25000.000000
4                AS  468333.333333
..              ...            ...
67               TH  618333.333333
68               TR  114600.000000
69               UA   57850.000000
70               US  157665.357566
71               VN   12000.000000

[72 rows x 2 columns]

In [16]:
#Calculate average salary based on company size 
average_salary_cs = dt.groupby('company_size')['salary'].mean()
average_salary_csize = average_salary_cs.reset_index()
print(average_salary_csize)

  company_size         salary
0            L  438794.372247
1            M  150712.836029
2            S  281430.101351